/*
https://csacademy.com/ieeextreme-practice/task/333043935273ab966569971859d1835b/
*/
#include <iostream>
using namespace std;

/*
Ιδέες: Στην πραγματικότητα έχουμε 2 προβλήματα. Η βέλτιστη λύση για το δεύτερο δίνει τα όρια για το πρωτό. Ουσιαστικά αν βρούμε το συντομότερο μονοπάτι μετά αρκεί από εκεί να βρούμε τον μεγαλύτερο αριθμό και απο εκεί θα βρούμε τους πρώτους μια φορά για την πόλη με το μεγαλύτερο id. 

Το άνω φράγμα δίνεται από κάποιον συνδυασμό από παραγωντικό και θα κλέψουμε χρησιμοποιώντας σαν δεδομένων την κατανομη των πρώτων αριθμών από την υπόθεση riemann. Ίσως για το τελευταίο.

Ευτυχώς για τα n και m το πλήθος είναι της τάξης του 10^4. 
*/

int main(){
	cout << "Hello!\n";
	return 0;
}